//================================================
//
// ゲーム背景処理[bg.cpp]
// Author; miura yuudai
//
//================================================

//=================================================
//インクルード読み込み
//=================================================
#include "bg.h"
#include "manager.h"
#include "Renderer.h"
#include "Scene2D.h"
#include "input.h"
#include "game.h"

//=============================================================================
//静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CBg::m_apTexture = NULL;

//=============================================================================
//バレットの設定・更新処理
//=============================================================================
CBg * CBg::Create(D3DXVECTOR3 pos)
{
	//ポインタ宣言
	CBg *pBg;
	pBg = new CBg;

	//初期化呼び出し
	pBg->Init(pos, SCREEN_HEIGHT, SCREEN_WIDTH);

	//テクスチャ呼び出し
	pBg->BindTexture(m_apTexture);

	//返り値
	return pBg;
}
//=============================================================================
//コンストラクタ
//=============================================================================
CBg::CBg(int nPriority) : CScene2D(nPriority)
{
	//ポーズの時になったらfalseに変更
	m_Pause = false;
}
//=============================================================================
//デストラクタ
//=============================================================================
CBg::~CBg()
{

}

//=============================================================================
//背景の初期化処理
//=============================================================================
HRESULT CBg::Init(D3DXVECTOR3 pos, float fHight, float fWidth)
{
	//初期化処理
	CScene2D::Init(pos, fHight, fWidth);

	//オブジェクトの週類の設定
	SetObjType(CScene::OBJTYPE_BG);

	//カウンターの初期化
	m_nCounterAnim = 0;

	//返り値
	return S_OK;
}

//=============================================================================
//背景の終了処理
//=============================================================================
void CBg::Uninit(void)
{
	//初期化処理
	CScene2D::Uninit();
}

//=============================================================================
//背景の更新処理
//=============================================================================
void CBg::Update(void)
{

}

//=============================================================================
//背景の描画処理
//=============================================================================
void CBg::Draw(void)
{
	//基本クラスの描画処理
	CScene2D::Draw();
}

//=============================================================================
//背景のテクスチャ処理
//=============================================================================
HRESULT CBg::Load(void)
{
	// 頂点情報を設定
	LPDIRECT3DDEVICE9 pDevice;

	//デバイスの取得
	pDevice = CManager::GetRenderer()->GetDevice();

	//テキスチャの読み込み
	D3DXCreateTextureFromFile(pDevice, "data/TEXTURE/game5.png", &m_apTexture);

	return S_OK;
}

//=============================================================================
//背景のテクスチャの廃棄処理
//=============================================================================
void CBg::Unload(void)
{
	//テクスチャの開放
	if (m_apTexture != NULL)
	{
		m_apTexture->Release();
		m_apTexture = NULL;
	}
}
