//*****************************************************************************
//
//カメラ処理[camera.h]
// Author; miura yuudai
//
//*****************************************************************************

#ifndef _CAMERA_H_
#define _CAMERA_H_

//*****************************************************************************
//インクルード読み込み
//*****************************************************************************
#include "main.h"

//*****************************************************************************
//カメラクラスの定義
//*****************************************************************************
class CCamera
{
public:
	CCamera(); //コンストラクタ
	~CCamera();//デストラクタ
	void Init(void);       //初期化処理
	void Uninit(void);                       //終了処理
	void Update(void);						 //更新処理
	void SetCamera(int nIdx);
private:
	D3DXVECTOR3 m_PosV[2];//視点
	D3DXVECTOR3 m_PosR[2];//注視点
	D3DXVECTOR3 m_VecU[2];//上方向ベクトル
	D3DXMATRIX m_mtxProjection[2];//プロジェクションマトリックス
	D3DXMATRIX m_mtxView[2];//ビューマトリックス
	D3DVIEWPORT9 m_viewport[2];//ビューポート
};
#endif
