//*****************************************************************************
//
//デバック表示処理[debugproc.h]
// Author; Miura　Yudai
//
//*****************************************************************************

#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

//*****************************************************************************
//マクロ定義
//*****************************************************************************
#define _CRT_SECURE_NO_WARNINGS
#define MAX_CHAR (2056) //文字の最大数

//*****************************************************************************
//インクルード読み込み
//*****************************************************************************
#include "main.h"

//*****************************************************************************
//デバック表示の定義
//*****************************************************************************
class CDebugProc
{
public:
	CDebugProc();//コンストラクタ
	~CDebugProc();//デストラクタ

	void Init(void);//初期化処理
	void Uninit(void);//終了処理
	static void Draw(void);//描画処理

	static void Print(const char *fmt, ...);//可変引数の関数(printf）

private:

	static LPD3DXFONT m_pFont;//フォントへのポインタ
	static char m_aStr[MAX_CHAR];//文字列を格納するバッファ
	static RECT m_rect;      //文字を書くために必要
};
#endif

